### Bank Data Set

In [1]:
# Import packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb

In [3]:
# Load data
df = pd.read_csv("./bank.csv")

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

In [4]:
df.describe()

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

1. Load Data
- Read the 'bank.csv' file.
- Clean the data by removing quotes.
- Load the cleaned data into a DataFrame using pandas with ';' as the separator.

In [13]:
def remove_quotes(text):
    return text.replace('"', '') if isinstance(text, str) else text

df = pd.read_csv('bank.csv') 
# we don't have quotes in the data set and even the row values are seperated with "," not the ;.
# so just reading CSV file is enough, incase if we have mention the delimiter we can do it with delimiter=';' or sep=';' into read csv method
df = df.applymap(remove_quotes) # apply method is used to modify values in the dataset
df = df.map(lambda value: None if (isinstance(value, str) and value == "unknown") else value) #  Refactor the data to include the Null values in place of unknown set the None value.

# df["pdays"] = [None if v == -1 else v for v in df.pdays] # the Pdays column is having integer data type and it should contain non zero values but it is having values with -1 which are Null values convert them to NaN
df

C:\Users\lokesh\AppData\Local\Temp\ipykernel_14824\3194130506.py:7: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(remove_quotes) # apply method is used to modify values in the dataset

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,NaN,0,None,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339.0,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330.0,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,None,3,jun,199,4,NaN,0,None,no
4,59,blue-collar,married,secondary,no,0,yes,no,None,5,may,226,1,NaN,0,None,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,NaN,0,None,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,None,9,may,153,1,NaN,0,None,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,NaN,0,None,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211.0,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249.0,7,other,no

2. Inspect Data Types
- Check the data types of all columns in the DataFrame.

In [8]:
df.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
y            object
dtype: object

In [14]:
df.isnull().sum()

age             0
job            38
marital         0
education     187
default         0
balance         0
housing         0
loan            0
contact      1324
day             0
month           0
duration        0
campaign        0
pdays        3705
previous        0
poutcome     3705
y               0
dtype: int64

In [18]:
duplicate_rows_count = len(df) - len(df.drop_duplicates())

print(f"Total duplicate rows: {duplicate_rows_count}")

Total duplicate rows: 0